//todo 页面完成度
const todo = {
	'财务管理': {
		// '待收费管理': {
		// 	'报名收费': true,
		// 	'补交学费': true,
		// 	'班型变更费': true,
		// 	'补考费': true,
		// 	'课时费': true,
		// 	'添加代培科目费': true,
		// },
		// '收入管理': {
		// 	'报名收费': true,
		// 	'补交学费': true,
		// 	'班型变更费': true,
		// 	'补考费': true,
		// 	'课时费': true,
		// 	'添加代培科目费': true,
		// 	'其它营收': true,
		// 	'货币资金': true,
		// },
		'支出管理': {
			'主营业务支出': false,
			'管理费': false,
			'其他业务支出': false,
			'资本支持': false,
			'所得税': false,
		},
		'退费管理': {
			'待退费': false,
			'已完成': false,
		},
		'工资管理管理': {
			'绩效数据报表': false,
			'工资登记': false,
		},
	},
	'审核管理': {
		'退费审核': false,
	},
	// '增值服务': {
	// 	'增值服务管理': true,
	// },
	// '资产管理': {
	// 	'车辆管理': true,
	// 	'场地管理': true,
	// },
	'教务管理': {
		'课时管理': false,
	},
	'学员管理': {
		'学员报名': {
			'本校': false,
			'代培': false,
			'挂靠': false,
			'委培': false,
		},
		'约课管理':false,
		'学员列表': {
			'本校学员': {
				'学习中': false,
				'已退学': false,
				'已毕业': false,
			},
			'委培学员': {
				'进行中': false,
				'已登录': false,
			},
			'代培学员': {
				'培训中': false,
				'培训结束': false,
			},
			'挂靠学员': {
				'学习中': false,
				'已退学': false,
				'已毕业': false,
			},
		},
	},
};
