// 大陆身份证
export const idCard = /^(([1][1-5])|([2][1-3])|([3][1-7])|([4][1-6])|([5][0-4])|([6][1-5])|([7][1])|([8][1-2]))\d{4}(([1][9]\d{2})|([2]\d{3}))(([0][1-9])|([1][0-2]))(([0][1-9])|([1-2][0-9])|([3][0-1]))\d{3}[0-9xX]$/;

// 港澳身份证
export const HKCard = /^([A-Z]\d{6,10}(\(\w{1}\))?)$/;

// 护照
export const passPortCard = /^([a-zA-z]|[0-9]){5,17}$/;

// 军官证
export const officerCard = /^[\u4E00-\u9FA5](字第)([0-9a-zA-Z]{4,8})(号?)$/;

// 手机号
export const mobile = /^1[3456789]\d{9}$/;

// 邮箱
export const email = /^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/;
